Ran Plan for project: `cloud-cloudflare-dns` dir: `infrastructure/cloud/cloudflare/dns` workspace: `terragrunt`

<details><summary>Show Output</summary>

```diff
22:29:37.963 INFO   Downloading Terraform configurations from ../../.. into ./.terragrunt-cache/8ebXUt5nVzXULYHMJ7TWlF3AZ8k/RnXWVc7nAaLzGbd_J7oKJRuJ4dM
22:29:38.628 STDOUT tofu: Initializing the backend...
22:29:38.952 STDOUT tofu: 
22:29:38.952 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
22:29:38.952 STDOUT tofu: use this backend unless the backend configuration changes.
22:29:39.060 STDOUT tofu: Initializing provider plugins...
22:29:39.061 STDOUT tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
22:29:39.287 STDOUT tofu: - Reusing previous version of backblaze/b2 from the dependency lock file
22:29:39.397 STDOUT tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
22:29:39.470 STDOUT tofu: - Reusing previous version of integrations/github from the dependency lock file
22:29:39.615 STDOUT tofu: - Reusing previous version of vexxhost/uptimerobot from the dependency lock file
22:29:39.730 STDOUT tofu: - Finding paultyng/unifi versions matching "~> 0.41"...
22:29:41.090 STDOUT tofu: - Installing integrations/github v6.2.2...
22:29:43.753 STDOUT tofu: - Installed integrations/github v6.2.2 (signed, key ID 38027F80D7FD5FB2)
22:29:45.032 STDOUT tofu: - Installing vexxhost/uptimerobot v0.8.2...
22:29:47.207 STDOUT tofu: - Installed vexxhost/uptimerobot v0.8.2. Signature validation was skipped due to the registry not containing GPG keys for this provider
22:29:48.516 STDOUT tofu: - Installing paultyng/unifi v0.41.0...
22:29:50.379 STDOUT tofu: - Installed paultyng/unifi v0.41.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
22:29:51.630 STDOUT tofu: - Installing hashicorp/aws v5.67.0...
22:31:06.710 STDOUT tofu: - Installed hashicorp/aws v5.67.0 (signed, key ID 0C0AF313E5FD9F80)
22:31:08.082 STDOUT tofu: - Installing backblaze/b2 v0.8.12...
22:31:15.929 STDOUT tofu: - Installed backblaze/b2 v0.8.12. Signature validation was skipped due to the registry not containing GPG keys for this provider
22:31:16.742 STDOUT tofu: - Installing cloudflare/cloudflare v4.42.0...
22:31:21.413 STDOUT tofu: - Installed cloudflare/cloudflare v4.42.0 (signed, key ID C76001609EE3B136)
22:31:21.414 STDOUT tofu: Providers are signed by their developers.
22:31:21.414 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
22:31:21.415 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
22:31:21.415 STDOUT tofu: OpenTofu has made some changes to the provider dependency selections recorded
22:31:21.415 STDOUT tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
22:31:21.416 STDOUT tofu: version control system if they represent changes you intended to make.
22:31:21.416 STDOUT tofu: OpenTofu has been successfully initialized!

22:32:03.395 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
22:32:03.395 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
22:32:03.396 STDOUT tofu:   + create
22:32:03.396 STDOUT tofu: OpenTofu will perform the following actions:
22:32:03.396 STDOUT tofu:   # cloudflare_record.internal_record["adguard_internal"] will be created
22:32:03.396 STDOUT tofu:   + resource "cloudflare_record" "internal_record" {
22:32:03.396 STDOUT tofu:       + allow_overwrite = false
22:32:03.396 STDOUT tofu:       + content         = (known after apply)
22:32:03.396 STDOUT tofu:       + created_on      = (known after apply)
22:32:03.396 STDOUT tofu:       + hostname        = (known after apply)
22:32:03.397 STDOUT tofu:       + id              = (known after apply)
22:32:03.397 STDOUT tofu:       + metadata        = (known after apply)
22:32:03.397 STDOUT tofu:       + modified_on     = (known after apply)
22:32:03.397 STDOUT tofu:       + name            = "adguard.internal"
22:32:03.397 STDOUT tofu:       + proxiable       = (known after apply)
22:32:03.397 STDOUT tofu:       + proxied         = false
22:32:03.398 STDOUT tofu:       + ttl             = 1
22:32:03.399 STDOUT tofu:       + type            = "A"
22:32:03.400 STDOUT tofu:       + value           = "192.168.1.51"
22:32:03.402 STDOUT tofu:       + zone_id         = (sensitive value)
22:32:03.403 STDOUT tofu:     }
22:32:03.403 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
22:32:03.403 STDOUT tofu: ╷
22:32:03.404 STDOUT tofu: │ Warning: Argument is deprecated
22:32:03.405 STDOUT tofu: │ 
22:32:03.405 STDOUT tofu: │   with cloudflare_record.internal_record["home_assistant_internal"],
22:32:03.406 STDOUT tofu: │   on 01-record.tf line 8, in resource "cloudflare_record" "internal_record":
22:32:03.407 STDOUT tofu: │    8:   value   = each.value["value"]
22:32:03.407 STDOUT tofu: │ 
22:32:03.407 STDOUT tofu: │ `value` is deprecated in favour of `content` and will be removed in the
22:32:03.408 STDOUT tofu: │ next major release.
22:32:03.409 STDOUT tofu: │ 
22:32:03.409 STDOUT tofu: │ (and 10 more similar warnings elsewhere)
22:32:03.409 STDOUT tofu: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cloud-cloudflare-dns
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.internal.siutsin.com/lock?id=siutsin%252Fotaru%252Finfrastructure%252Fcloud%252Fcloudflare%252Fdns%252Fterragrunt)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cloud-cloudflare-dns
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```